Repository: 84000/data-translation-memory
Catalog: toh79-v3.tmx
Source language: bo
Languages: en

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་དག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Bhagavān then gave the monks his approval. “Good!”

source: གནས་བརྟན་རབ་འབྱོར་ལ་བཀའ་སྩལ་པ། རབ་འབྱོར་དགེ་སློང་འདི་དག་གིས་ཇི་སྐད་བསྟན་པ་དེ་དེ་བཞིན་ནོ། །
en: he said, and then he addressed the elder Subhūti: “Subhūti, what these monks have said is true.

source: རབ་འབྱོར་དགེ་སློང་འདི་དག་གིས་དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་གི་གསུང་རབ་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཉིད་ལས་ཟབ་མོའི་ཆོས་བསྟན་པ་འདི་ལྟ་བུ་འདི་ཐོས་ཏེ།
en: Subhūti, they have heard this profound Dharma teaching found in the discourses of the Tathāgata Kāśyapa, from Mañjuśrī Kumārabhūta.

source: ཆོས་ཟབ་མོ་མཉན་པ་དེ་ཉིད་ཀྱི་རྒྱུས་འདི་ལྟར་མངོན་པར་ཤེས་པ་མྱུར་བར་གྱུར་ཏོ། །
en: Because they have received this profound Dharma, they have quickly attained the higher perceptions.

source: ཟབ་མོའི་ཆོས་བསྟན་པ་འདི་ལ་ཡང་རྗེས་སུ་འཐུན་པར་གྱུར་ཏེ་མི་འཐུན་པ་མ་ཡིན་ནོ། །
en: They are in harmony with this profound Dharma teaching; they are not in conflict with it.

source: རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་མ་གཏོགས་པར་གང་དག་དེའི་གསུང་རབ་འདི་ལ་ཆོས་ཟབ་མོ་བསྟན་པ་འདི་ཉན་ཅིང་ཐོས་ནས་ཀྱང་ལྷག་པར་མོས་པ་དེ་དག་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་གསུང་རབ་ལ་འདུས་པ་གསུམ་གྱི་གྲངས་སུ་གཏོགས་པར་རིག་པར་བྱའོ། །
en: Subhūti, reckoning thus, it should be understood that—apart from those who have already set out on the Great Vehicle—all those who have listened to this profound Dharma teaching found in my discourses and who, having heard it, remain intent on it, will be counted among the three audiences at the discourses of the Tathāgata Maitreya.

source: གང་ཡང་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་དེ་ནི་བཟོད་པ་གང་ཡང་རུང་བ་འཐོབ་པར་འགྱུར་རོ། །
en: Anyone who sets out on the Great Vehicle will reach acceptance suitable to their disposition.”

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་ཁྱོད་རྒྱུན་ཏུ་འཛམ་བུའི་གླིང་ན་ཆོས་སྟོན་ཏམ།
en: Then the god Śrībhadra beseeched Mañjuśrī Kumārabhūta, “Mañjuśrī, are you going to continue to teach the Dharma just in Jambudvīpa?

source: འཇམ་དཔལ་དགའ་ལྡན་གྱི་གནས་སུ་བཞུད་དོ། །
en: Mañjuśrī, please come to the Heaven of Joy.

source: དེར་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཆོས་བསྟན་དུ་གསོལ། དེ་ན་ལྷའི་བུ་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དག་ཡོད་དེ།
en: Teach the Dharma to the gods there, who have served previous victors and have cultivated roots of virtue.

source: དེ་དག་ཡུལ་ཕུན་སུམ་ཚོགས་པས་བག་མེད་པའི་དབང་གིས་བཅོམ་ལྡན་འདས་དང་།
en: Because they live in a perfect realm, they have no sense of urgency and have not come to listen to the Dharma taught by the Bhagavān and you.

source: ཁྱོད་ལ་ཆོས་ཉན་དུ་མི་འོང་བས་ན་དེ་དག་ཆོས་མི་ཉན་པས་ཡོངས་སུ་ཉམས་པར་འགྱུར་ཏེ།
en: If they do not listen to the Dharma, they will become degenerate.

source: དེ་དག་ཁྱོད་ལས་ཆོས་ཐོས་ནས་དགེ་བའི་རྩ་བ་ཆེན་པོ་འཕེལ་བར་འགྱུར་རོ། །
en: But once they hear the Dharma from you, great roots of virtue will grow.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེའི་ཚེ་གང་གིས་ལྷའི་བུ་དཔལ་བཟངས་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དག་དགའ་ལྡན་གྱི་གནས་སུ་བཞུགས་པར་བདག་ཉིད་ཀྱིས་ཤེས་པ་དང་། ཉམས་དགའ་བའི་ཀུན་དགའ་ར་བ་དང་། ཉམས་དགའ་བའི་ཚལ་དང་། ཉམས་དགའ་བའི་རྫིང་དང་།
en: Thereupon Mañjuśrī Kumārabhūta manifested a magical emanation, which the god Śrībhadra and the entire assembly recognized as the Heaven of Joy.

source: ཉམས་དགའ་བའི་སྐྱེད་མོས་ཚལ་དང་། རིམ་པ་བདུན་དང་། བརྒྱད་དང་། བཅུ་དང་། ཉི་ཤུ་པའི་ཁང་པ་བརྩེགས་པ་བསིལ་ཁང་དང་། བ་གམ་དང་། སྟེགས་བུ་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་ལྡན་པ་དེ་དག་ཀྱང་སྣང་བ་དང་།
en: There were delightful gardens, groves, ponds, and parks, and mansions that were seven, eight, ten, and twenty stories high, all with balconies, terraces, arches, and windows.

source: ལྷའི་བུ་མོ་རྐང་ལག་འཇམ་ཞིང་མཉེན་པ། གསེར་གྱི་དྲ་བ་ལྟར་འོད་རྣམ་པར་དག་པ། སྨིན་མ་ལེགས་པ། འཕྲལ་བ་ལེགས་པ། བཞིན་ལེགས་པ།
en: There were goddesses with smooth and graceful arms and legs, radiant like golden lattices, with fine eyebrows, good foreheads, and lovely faces.

source: མིག་པད་མ་འདབ་མ་བརྒྱད་པ་སྔོན་པོ་ལྟ་བུར་མཛེས་ཤིང་དྲི་མ་མེད་པ་ཤིན་དུ་ཡངས་པ། འདོད་པའི་སེམས་བསྐྱེད་པ། ཟླ་བ་ཚེས་པ་ལྟར་མངོན་པར་དགའ་བ། བཞིན་འཛུམ་པ་དང་བཅས་པ་དེ་དག་རྒྱུད་གཅིག་པ་དང་། པི་བང་དང་། སྒྲ་སྙན་དང་། ཁར་བའི་སིལ་ཁྲོལ་དང་། ཕེག་དང་། རྔ་ཟླུམ་དང་། རྫ་རྔ་དང་། རྔ་སྙན་པ་དང་། གླིང་བུ་དང་།
en: Smiling with large, flawless, beautiful eyes like eight-petaled blue lotuses, they aroused desire and brought joy like the night of a full moon.

source: གླུ་དབྱངས་དང་། རོལ་མོའི་དབྱངས་སྒྲ་དང་། གར་དང་། བཞད་གད་དང་། འཇོ་བ་དང་།
en: Playing music on various kinds of lutes and harps, sitars, metal bells, cymbals, round drums, clay drums, melodious drums, and flutes, they sang in harmonies, played and danced, laughing and seductive, flirtatious and teasing, joyful, playful, and rapturous.

source: སྒེག་པ་དང་།
en: Such was the transformation he blessed into being.

source: རྩེ་བས་རྒྱགས་ཤིང་དགའ་བ་དང་། རྩེ་བ་དང་། དགའ་མགུར་སྤྱོད་པ་དག་ཀྱང་སྣང་བ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་བྱ་བ་མངོན་པར་བྱས་སོ། །དེ་འདྲ་བའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་གྱིས་རླབས་སོ། །དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་རང་གི་གནས་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་ཡང་མཐོང་།
en: Then the god Śrībhadra saw his own residence, replete with all its adornments.

source: རང་གི་གཡོག་འཁོར་རྣམས་ཀྱང་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་ངོ་མཚར་དུ་གྱུར་ཏེ།
en: He saw his own servants and attendants, and seeing them, he was astonished.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་བདག་ཅག་འདི་ལྟར་མྱུར་དུ་དགའ་ལྡན་གྱི་གནས་སུ་ཕྱིན་ཏེ། ཉམས་དགའ་བའི་ཀུན་དགའི་ར་བ་འདི་དག་དང་ཞེས་བྱ་བ་ནས། དགའ་བ་དང་། རྩེ་བ་དང་།
en: He said to Mañjuśrī Kumārabhūta, “Mañjuśrī, it seems we have swiftly arrived in the Heaven of Joy, complete with its delightful gardens,” and he proceeded to list everything up to those goddesses who were “joyful, playful, and rapturous.”

source: དགའ་མགུར་སྤྱོད་པ་དང་། བདག་གི་རང་གི་གནས་འདི་དང་རང་གི་གཡོག་ཅེས་བྱ་བའི་བར་དུ་སྦྱར་ཏེ།
en: He added, “This is my home, and these are my own servants.

source: འདི་དག་སྣང་བ་ངོ་མཚར་ཏོ། །
en: I am astonished by these apparitions.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ལྷའི་བུ་དཔལ་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷའི་བུ་ཁྱོད་ནི་འཁོར་གྱི་དཀྱིལ་འཁོར་འདི་ནས་གང་དུ་ཡང་མ་གཡོས་ལ། དགའ་ལྡན་གྱི་གནས་སུ་ཡང་མ་ཕྱིན་ཏེ།
en: Venerable Subhūti then said to the god Śrībhadra, “Divine being, you have not moved from this assembly, nor have you gone to the Heaven of Joy.

source: ལྷའི་བུ་འོན་ཀྱང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་དགའ་ལྡན་གྱི་གནས་སུ་ཞུགས་པར་བདག་ཉིད་ཀྱིས་ཤེས་པ་དང་།
en: However, divine being, the entire assembly is now convinced that they are in the Heaven of Joy.

source: ལྷའི་བུ་ཁོ་བོ་ཅག་ཀྱང་དགའ་ལྡན་གྱི་གནས་སུ་ཞུགས་པར་བདག་ཉིད་ཀྱིས་ཤེས་པ་དེ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་བའི་ཆོ་འཕྲུལ་དང་།
en: Indeed, divine being, we are all convinced that we are in the Heaven of Joy.

source: ཏིང་ངེ་འཛིན་གྱི་བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་སོ། །
en: This is the magical power of Mañjuśrī Kumārabhūta to create miraculous manifestations, and the transformative power of his meditative absorption.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་བའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: The god Śrībhadra remarked to the Bhagavān, “Bhagavān, the magical power of Mañjuśrī Kumārabhūta to create miraculous manifestations and the transformative power of his absorption are inconceivable.

source: འདི་ལྟར་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་ས་ཕྱོགས་འདི་ནས་གང་དུ་ཡང་མ་གཡོས་པར་འདི་སྙམ་དུ་བདག་ཅག་དགའ་ལྡན་གྱི་གནས་སུ་ཕྱིན་ཏོ་སྙམ་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: It is astonishing to think that although the entire assembly has not moved from this place to anywhere else, they are convinced that we have all gone to the Heaven of Joy.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་ཅིག་ངས་ཤེས་པ་ལས་ཁྱོད་ཀྱིས་ཇི་ཙམ་ཞིག་ཤེས་ཏེ།
en: “Divine being,” replied the Bhagavān, “what could you know of the extent of what I know of Mañjuśrī Kumārabhūta’s miraculous manifestations?

source: ལྷའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདོད་ན་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཞིང་གཅིག་ཏུ་ཡང་དག་པར་སྟོན་ཏོ། །
en: Divine being, if Mañjuśrī Kumārabhūta so wished, he could show you an array of the good qualities of buddhafields as numerous as the grains of sand along the banks of the Ganges, all within a single field.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གང་དག་ཡོད་པ།
en: He could string as many buddhafields as there are grains of sand along the banks of the Ganges along the hair of his top-knot and hold them there in the space above his head.

source: དེ་དག་གཙུག་ཕུད་ཀྱིས་ཕུག་སྟེ། སྟིང་གི་བར་སྣང་གི་ནམ་མཁའ་ལ་འཇོག་གོ །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་རྒྱ་མཚོ་ཆེན་པོར་གྱུར་པའི་ཆུའི་ཕུང་པོ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་བླུགས་ཀྱང་ཆུའི་སེམས་ཅན་རྣམས་ལ་གནོད་པ་མེད་དེ། ཐམས་ཅད་ཀྱང་རང་རང་གི་རྒྱ་མཚོ་ཆེན་པོ་ན་གནས་པར་བདག་ཉིད་ཀྱིས་ཤེས་སོ། །
en: He could pour all the waters of the great oceans in those buddhafields into a single hair pore, without harming any of the beings that live in those waters, and all the beings would be convinced that they were still in their own great oceans.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་རིའི་རྒྱལ་པོ་རི་རབ་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་རི་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་ཏེ། རི་དེ་དག་ཡུངས་ཀར་གྱི་འབྲུའི་ནང་དུ་བཅུག་ཀྱང་རི་རབ་ལ་གནས་པའི་ལྷ་དེ་དག་ལ་ཡང་གནོད་པ་མེད་དེ། ཐམས་ཅད་ཀྱང་རང་རང་གི་གནས་ན་འཁོད་པར་བདག་ཉིད་ཀྱིས་ཤེས་སོ། །
en: With his blessing he could condense all the Mount Sumerus, the kings of mountains, in all the buddhafields into one mountain, and could place them all inside a single mustard seed, and the gods living on each of those Mount Sumerus, those kings of mountains, would be unharmed, and each would be convinced that they were still settled in their own abodes.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་འགྲོ་བ་ལྔར་སྐྱེས་པའི་སེམས་ཅན་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ལག་པ་གཡས་པའི་མཐིལ་དུ་བཞག་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པའི་སེམས་ཅན་རྣམས་ཀྱི་བདེ་བར་སྦྱར་བ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་དག་དེ་དག་ལ་སྒྲུབ་པོ། །
en: He could place all the sentient beings born as the five types of beings in those buddhafields in the palm of his right hand and could make them as happy as sentient beings in worlds adorned with every single pleasure.

source: གང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སྲེག་པར་བྱེད་པའི་མེ་དེ་དག་ཐམས་ཅད་མར་མེའི་སྙིང་པོ་གཅིག་གི་མེ་ལྕེ་ཙམ་གྱི་མེར་བྱིན་གྱིས་རློབ་སྟེ།
en: He could transform all the fires burning in as many buddhafields as there are grains of sand along the banks of the Ganges into the flame of single oil-lamp wick.

source: དེས་བྱ་བ་བྱེད་པ་གང་ཡིན་པ་དེ་བྱེད་དོ། །
en: Whatever could be done, he can do.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན་ཉི་མ་དང་ཟླ་བའི་འོད་གང་དག་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྤུའི་ཁུང་བུ་གཅིག་གི་འོད་ཀྱིས་ཟིལ་དུ་རླག་པར་བྱེད་དོ། །
en: He could outshine all the light of the suns and moons of buddhafields as numerous as the grains of sand along the banks of the Ganges with the light rays emitting from just one of his pores.

source: ལྷའི་བུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་ལས་བརྩམས་ནས་ང་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་ཡང་ཆོས་སྟོན་ཏེ།
en: Divine being, on the topic of Mañjuśrī Kumārabhūta’s magical powers to create miraculous manifestations, I could teach the Dharma for an eon, or even more than an eon.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་རྫུ་འཕྲུལ་དང་བྱིན་གྱི་རླབས་ཀྱི་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ལྟ་བུ་དང་ལྡན་ནོ།། །།བམ་པོ་གཉིས་པ་སྟེ་ཐ་མ།
en: Mañjuśrī Kumārabhūta is endowed with such inconceivable miraculous manifestations and powerful blessings.”

source: དེ་ནས་བདུད་སྡིག་ཅན་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ནས་འདུག་སྟེ། དེས་བདག་ཉིད་དགེ་སློང་གི་གཟུགས་སུ་བྱིན་གྱིས་བརླབས་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་དེ་བདག་གིས་བལྟ་བར་བགྱིའོ། །
en: Then Māra Pāpīyān, who had come to be seated in that assembly, transformed himself into the form of a monk, and said to the Bhagavān, “Bhagavān, let me witness Mañjuśrī Kumārabhūta’s magical power to create miraculous manifestations.

source: བཅོམ་ལྡན་འདས་ཚིག་ཙམ་དུ་གསུངས་པས་ཅི་སྨན་གྱིས་བདག་ལ་མངོན་སུམ་དུ་གྱུར་ཅིག །
en: Bhagavān, what benefit is there in mere words? Let me see it directly!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྡིག་ཅན་དུ་མཁྱེན་བཞིན་དུ་སེམས་ཅན་ཚད་མེད་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྤེལ་བའི་ཕྱིར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་ངས་ཁྱོད་ལ་བསྐུལ་གྱིས་ཁྱོད་ཀྱིས་འཁོར་འདི་དག་ལ་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་དང་ཆོ་འཕྲུལ་སྟོན་ཅིག་དང་། སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: The Bhagavān, knowing that this was Māra Pāpīyān, said to Mañjuśrī Kumārabhūta, so as to increase the roots of virtue for limitless sentient beings, “Mañjuśrī, I beseech you, show the assembly your power to create miraculous manifestations and your power of transformation, so that the roots of virtue of limitless sentient beings will increase.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྐུལ་བར་ཤེས་ནས་ཆོས་ཐམས་ཅད་སེམས་ཀྱིས་དབང་སྒྱུར་བ་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ། །
en: Thereupon Mañjuśrī Kumārabhūta, understanding the Bhagavān’s request, entered the absorption called manifestation of the power to control all phenomena with the mind.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཆོས་ཐམས་ཅད་སེམས་ཀྱིས་དབང་སྒྱུར་བ་རྣམ་པར་འཕྲུལ་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་གསུངས་པ་དེ་བཞིན་དུ་མ་ཆད་པ་དང་།
en: As soon as Mañjuśrī Kumārabhūta entered this absorption called manifestation of the power to control all phenomena with the mind, at that very moment, the entire assembly witnessed his magical power to create miraculous manifestations, precisely as the Bhagavān had described, without anything left out, without anything extra added on, and without any excess embellishment.

source: མ་ལྷག་པ་དང་། མི་མང་བར་མཐོང་ངོ་། །དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་གྱིས་ཆོ་འཕྲུལ་དེ་མཐོང་ནས་ངོ་མཚར་དུ་གྱུར་ཏེ། སངས་རྒྱས་བྱུང་བ་ལེགས་སོ་ལེགས་སོ། །
en: When they had seen those miraculous manifestations, the entire assembly was amazed and with sincere devotion they uttered these words: “That the Buddha has appeared is excellent, it is excellent!

source: སངས་རྒྱས་བྱུང་བ་ནི་སེམས་ཅན་རྣམས་ལ་དོན་ཆེན་པོར་ཉེ་བར་གནས་སོ། །
en: The Buddha’s appearance brings great benefit to beings.

source: དེ་བྱུང་བས་སྐྱེས་བུ་དམ་པ་འདི་ལྟ་བུ་འདི་དག་ཀྱང་འཇིག་རྟེན་དུ་བྱུང་བ་ཡིན་ནོ། །
en: Because he has appeared, holy beings such as this also appear in the world.

source: ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ལྟ་བུ་ཡང་འཇིག་རྟེན་ན་སྣང་བ་ཡིན་ནོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ཆེད་དུ་བརྗོད་དོ། །
en: And inconceivable miracles such as these appear in the world.”

source: དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཆོ་འཕྲུལ་དེ་མཐོང་སྟེ།
en: When Māra Pāpīyān saw this magical power he was awestruck.

source: ངོ་མཚར་དུ་གྱུར་ནས་ཐལ་མོ་སྦྱར་ཏེ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ཞིང་ཚིག་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: With his palms joined, he paid homage to Mañjuśrī Kumārabhūta and said, “Mañjuśrī Kumārabhūta’s magical power to create miraculous manifestations is inconceivable.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་སྟེ་ངོ་མཚར་ཏོ། །
en: It is amazing.

source: སེམས་ཅན་གང་དག་ཆོ་འཕྲུལ་བཤད་པ་འདི་ཐོས་ནས་མོས་པ་དེ་དག་ངོ་མཚར་ཆེ་བར་བདག་གིས་བསམས་སོ། །
en: I think any sentient being who hears about these miracles will have faith and be amazed.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བདུད་སྡིག་ཅན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་གྱུར་ཀྱང་དེ་ལྟར་མོས་པའི་སེམས་ཅན་དེ་ལ་བར་ཆད་བགྱི་བའི་རྔོ་མི་ཐོག་ལགས་སོ། །
en: Bhagavān, even if there were as many wicked māras as there are grains of sand along the banks of the Ganges, they would still be unable to obstruct sentient beings with such faith.

source: བཅོམ་ལྡན་འདས་བདུད་སྡིག་ཅན་བདག་ནི་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་དེ་བཞིན་གཤེགས་པ་ལ་གླགས་ལྟ་ཞིང་སྐབས་ཚོལ་བ་དང་།
en: “Bhagāvan, I, Māra Pāpīyān, always and constantly seek every opportunity to harm the Tathāgata.

source: སེམས་ཅན་རྣམས་ལ་ཡང་གཙེ་བར་སེམས་པ་དང་། བརྩོན་པའི་གང་ཟག་རྣམས་ཀྱི་དགེ་བའི་རྩ་བའི་བར་ཆད་བགྱི་བའི་སླད་དུ་ཡང་ཞུགས་པ་ལགས་ཏེ། བཅོམ་ལྡན་འདས་དེང་སླན་ཆད་གྲོང་དང་།
en: I hang around with the intention of hurting sentient beings and severing the roots of virtue of those who strive.

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། ཕོ་བྲང་འཁོར་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རབ་ཏུ་སྤྱོད་པ་དེར་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་བརྒྱ་ཚུན་ཆད་དུ་མིག་གིས་མི་རྩོལ་བར་བགྱི་བའི་སླད་དུ་བདག་མི་མཆི་བར་བདག་ཡི་དམ་དེ་ལྟ་བུ་བླང་བར་བགྱིའོ། །
en: So, Bhagavān, from this day hence, I vow not to go within a radius of a hundred yojanas of those who practice this Dharma discourse, nor will I try to disturb them whether they are in villages, towns, cities, provinces, countries, or palaces.

source: གང་དག་འཆང་བ་དང་། འཆད་པ་དང་། སྟོན་པ་དང་། སོ་སོར་རྟོག་པ་དང་། བསྒྲུབ་པ་དེ་ལ་སྟོན་པ་ལ་བགྱི་བ་ལྟར་གུས་པ་བསྐྱེད་པར་བགྱིའོ། །
en: I will be as respectful toward those who uphold, explain, teach, analyze, and practice this Dharma as I am toward the Teacher.

source: བཅོམ་ལྡན་འདས་འོ་ན་དུ་ལགས་ཀྱང་བདག་གི་འཁོར་གང་དེ་བཞིན་གཤེགས་པའི་བསྟན་པའི་བར་ཆད་བགྱི་བ་དང་། བརྩོན་པ་རྣམས་གཡེངས་པར་བགྱི་བའི་སླད་དུ་ཞུགས་པ་དག་མཆིས་ཏེ་དེ་དག་ཆད་པས་དགུམ་པའི་སླད་དུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་དྲན་པར་བགྱིའོ། །ཏདྱ་ཐཱ། ཨ་མ་ལེ། བི་མ་ལེ། སྠི་ཏ་ཏྭེ། ཨ་ག་ལ་མ་ནི་རྫི་ཏ་ཤ་ཏྲུ། ཛ་ཡེ་ཛ་ཡ་བ་ཏི། བྷཱུ་ཏ་མ་ཏི། ཤ་མེ། ཤཱན་ཏི། ཨ་ཕུ་མེ། ཕུ་ཕུ་མེ། དྷི་རེ། ཨ་ཁེ། མ་ཁེ། ཁ་ཁེ། མི་སི་ལེ། ཨ་ག་མེ། ཕུ་ལ་ཏེ། ཕུ་ལ། ཕུ་ལེ། ཕ་ཤུ་མེ། ཤུ་ཤུ་མེ། དྷི་དྷེ་རེ། ཨ་ན་བ་ན་ཏེ། སྠི་ཏ་ཏྭེ།
en: Nevertheless, Bhagavān, there are some in my retinue who will try to obstruct the teachings of the Tathāgata and hang around to distract people from their efforts.

source: ཀྲྀ་ཏཱ་ར་ཐེ། ཀྲི་ཏཱ་བཱིརྱ། བཻ་རོ་ཙ་ན་སད་དྷརྨ་བྷ་ཎ་ཀོ་སྱ་སཱུ་ཏྲ་སྱ་དྷཱ་རི་ཀ། ཨ་བྷྲ་མུ་ག་ཏ་ཨི་བ་སཱུརྱ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཆོས་སྨྲ་བ་གང་གསང་སྔགས་ཀྱི་ཚིག་འདི་རྣམས་ཀྱིས་ཀུན་དུ་བསྲུངས་པ་དེ་ལ་བདུད་ཀྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་བར་ཆད་བགྱི་བ་ནི་གནས་མ་ལགས་ཤིང་སྐབས་མ་ལགས་ཏེ།
en: So, in order to annihilate and kill them, sons and daughters of the lineage should remember these secret mantra words: tadyathā | amale vimale sthitatve agalam anirjita­śatrujaye jayavati bhūtamati śame śānti aphu me phu phu medhire akhe makhe khakhe misile agame phulate phula phule phaśu me śuśu me dhidhere anavanate sthitatve kṛtārthe kṛtavīrya vairocana saddharmabhaṇako ’sya sūtrasya dhāraka abhram ugata iva sūrya svāhā | “Bhagavān, preachers of the Dharma will be thoroughly protected by these words, and gods of the māra realm who would hinder them will have no opportune time or place.

source: དེ་ནི་གནས་མ་མཆིས་ཀྱི་སྟེང་དུ་དེ་ལ་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཉེ་བར་བསྒྲུབ་པ་དང་།
en: And before departing, they will make donations of robes, alms, bedding, medicine for sickness, and assembled useful provisions to them.

source: སྤྲོ་བར་བགྱི་བ་དང་། སྤོབས་པར་བགྱི་བར་སྤྲོ་བར་འགྱུར་ལགས་སོ། །
en: They will delight them and will delight in inspiring them.

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་དག་གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་བརྗོད་པས་གཡེང་བ་མ་མཆིས་པའི་རྒྱུད་ཀྱིས་གདུགས་མཚན་འདས་པར་བགྱིད་པ་དེ་དག་ལྷ་རྣམས་ཀྱིས་བསྲུངས་པར་འགྱུར། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: Bhagavān, sons and daughters of the lineage who utter this mantra will have undistracted minds both day and night, and will be protected by the gods.

source: ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ལགས་པ་རྣམས་ཀྱིས་བསྲུངས་པར་འགྱུར་ཏེ།
en: They will be protected by nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas, as well as humans and nonhumans alike.

source: དེ་དག་ལ་སླར་རྒོལ་བའམ་མི་མཛའ་བ་གང་གིས་གླགས་བལྟས་ཀྱང་གླགས་རྙེད་པར་མི་འགྱུར་ལགས་སོ། །
en: Henceforth any opponents and enemies who try to harm them will be unable to do so.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྡིག་ཅན་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Bhagavān then gave Māra Pāpīyān his approval: “This is excellent, Pāpīyān, just excellent!

source: སྡིག་ཅན་ལེགས་སོ་ལེགས་སོ། །འདིར་ཁྱོད་ཀྱིས་གསང་སྔགས་ཀྱི་ཚིག་བསྟན་པ་བརྗོད་པས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ།
en: Your presentation of this mantra here has shaken the realms of the world, as numerous as the grains of sand along the banks of the Ganges, in six ways.

source: ཁྱོད་ཀྱི་སྤོབས་པ་དེ་ཐམས་ཅད་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་བྱིན་གྱིས་བརླབས་སུ་རིག་པར་བྱའོ། །
en: All of your eloquence should be considered a blessing of Mañjuśrī Kumārabhūta.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྫུ་འཕྲུལ་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་དང་བྱིན་གྱི་རླབས་འདི་བསྟན་པ་དང་། བདུད་ཀྱི་གསང་སྔགས་ཀྱི་སྟོབས་དང་། རིག་སྔགས་ཀྱི་སྟོབས་བསྟན་པ་ན་སྲོག་ཆགས་ཉི་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ། །
en: While Mañjuśrī Kumārabhūta’s magical power to create miracles and his blessings were being revealed, and while the power of Māra’s secret mantra and the power of his vidyā mantra were being taught, twenty thousand beings developed the mind set on unsurpassable, completely perfect awakening.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་རྫུ་འཕྲུལ་བསྡུས་ནས་ལྷའི་བུ་དཔལ་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Mañjuśrī Kumārabhūta, gathering in his miraculous manifestations, said to the god Śrībhadra, “Divine being, return to the Heaven of Joy!

source: ལྷའི་བུ་ཁྱོད་དགའ་ལྡན་གྱི་གནས་སུ་སོང་ལ་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་སྡུས་ཤིག་དང་ཁོ་བོ་ཡང་དེར་འོང་ངོ་། །
en: Assemble the gods of the Heaven of Joy and I will come there.”

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ལྟར་མཉན་ཏེ། བཅོམ་ལྡན་འདས་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཐམས་ཅད་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ལ་བསྐོར་བ་བྱས་ནས་འཁོར་དང་བཅས་པར་འཁོར་དེ་ནས་མི་སྣང་བར་གྱུར་ཏེ་དགའ་ལྡན་གྱི་གནས་སུ་ཕྱིན་ཏོ། །
en: After listening to Mañjuśrī Kumārabhūta, the god Śrībhadra circumambulated the Bhagavān, Mañjuśrī Kumārabhūta, and the entire saṅgha of bodhisattvas and śrāvakas, then disappeared from the assembly, departing for the Heaven of Joy.

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ལ་སྨྲས་པ། གྲོགས་པོ་དག་ཤེས་པར་གྱིས་ཤིག །
en: There, the god Śrībhadra said to the gods of the Heaven of Joy, “Friends, let it be known!

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའོ་བུ་ཅག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་འདིར་འོང་གིས་དེ་ལ་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷ་ཁྱེད་དགའ་བ་དང་།
en: Mañjuśrī Kumārabhūta is coming here out of love and compassion for us. You, gods of the Heaven of Joy, give up your heedless joys and pleasures.

source: རྩེ་བ་ལ་བག་མེད་པ་འོར་ཏེ་བག་ཡོད་པར་གྱིས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཆོས་ཉན་དུ་ཤེག་ཤིག །
en: Be heedful, and come to listen to the Dharma of Mañjuśrī Kumārabhūta!”

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་དགའ་ལྡན་གྱི་གནས་ཀྱི་དབུས་སུ་ལྷའི་ཡིད་ལས་བྱུང་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་པའི་འཁོར་གྱི་ཁྱམས་ཆུར་ཤར་ནུབ་ཏུ་དཔག་ཚད་སུམ་ཁྲི་ཉིས་སྟོང་ཡོད་ལ།
en: In order to make offerings to Mañjuśrī Kumārabhūta, the god Śrībhadra prepared an assembly space enclosed by water in the center of the Heaven of Joy.

source: ཞེང་ལྷོ་བྱང་དུ་དཔག་ཚད་ཁྲི་དྲུག་སྟོང་ཡོད་པ་བྱས་ཏེ།
en: It was made from all kinds of precious jewels sprung from the minds of the gods, and it extended thirty-two thousand yojanas from east to west and sixteen thousand yojanas from north to south.

source: དེར་སེང་གེའི་ཁྲི་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ་ལྷའི་རས་བཅོས་བུ་བརྒྱ་སྟོང་དུ་མ་བཏིང་བ་སྟོང་ཕྲག་དུ་མ་བྱས་སོ། །དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་རྣམ་པ་འདི་ལྟ་བུའི་འཁོར་གྱི་ཁྱམས་བཀོད་པ་དེ་དག་དང་།
en: In it he set out various lion thrones, beautiful to behold, adorned with many hundreds and thousands of heavenly fabrics, and many thousands of seating mats.
